In [19]:
import numpy as np
import pandas as pd

#### 연습 문제 1
1. 임의로 두 개의 시리즈 객체를 만든다. 모두 문자열 인덱스를 가져야 하며 두 시리즈에 공통적으로 포함되지 않는 라벨이 있어야 한다.
2. 위에서 만든 두 시리즈 객체를 이용하여 사칙 연산을 한다.

In [7]:
ob1=pd.Series([38.83, 1078, 2775, 3441], index=['합격률', '취득자수', '응시자수', '접수자수'])
ob1.name="2016년 Adsp합격률"
ob1.index.name = "구분"
ob1

구분
합격률       38.83
취득자수    1078.00
응시자수    2775.00
접수자수    3441.00
Name: 2016년 Adsp합격률, dtype: float64

In [8]:
ob2=pd.Series([30.39, 584, 1922, 2687], index=['합격률', '취득자수', '응시자수', '접수자수'])
ob2.name="2015년 Adsp합격률"
ob2.index.name = "구분"
ob2

구분
합격률       30.39
취득자수     584.00
응시자수    1922.00
접수자수    2687.00
Name: 2015년 Adsp합격률, dtype: float64

In [9]:
ob1+ob2

구분
합격률       69.22
취득자수    1662.00
응시자수    4697.00
접수자수    6128.00
dtype: float64

In [10]:
ob1-ob2

구분
합격률       8.44
취득자수    494.00
응시자수    853.00
접수자수    754.00
dtype: float64

In [11]:
ob1*ob2

구분
합격률     1.180044e+03
취득자수    6.295520e+05
응시자수    5.333550e+06
접수자수    9.245967e+06
dtype: float64

In [12]:
ob1/ob2

구분
합격률     1.277723
취득자수    1.845890
응시자수    1.443809
접수자수    1.280610
dtype: float64

#### 연습 문제 2
다음 조건을 만족하는 임의의 데이터프레임을 하나 만든다.

1. 열의 갯수와 행의 갯수가 각각 5개 이상이어야 한다.
2. 열에는 정수, 문자열, 실수 자료형 데이터가 각각 1개 이상씩 포함되어 있어야 한다.

In [23]:
data = { "서울" : ['흐림', 30.3, 82, 69, 14.8],
       "청주" : ['구름많음', 33.2, 84, 59, 8.3],
       "대전" : ['구름많음', 32.8, 85, 65, 14],
       "전주" : ['구름많음', 32.2, 86, 78, 10.4],
       "울산" : ['구름조금', 32, 83, 64, 14.8],}
index = ["현재일기",'현재기온','불쾌지수','습도%','풍속km/h']
columns = ['서울', '청주', '대전', '전주', '울산']
df = pd.DataFrame(data, index=index, columns=columns)
df

          서울    청주    대전    전주    울산
현재일기      흐림  구름많음  구름많음  구름많음  구름조금
현재기온    30.3  33.2  32.8  32.2    32
불쾌지수      82    84    85    86    83
습도%       69    59    65    78    64
풍속km/h  14.8   8.3    14  10.4  14.8

#### 연습 문제 3

다음 데이터프레임에서 지정하는 데이터를 뽑아내거나 처리하라.

```
data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df = pd.DataFrame(data, index=index, columns=columns)
```

1. 모든 학생의 수학 점수를 시리즈로 나타낸다.
1. 모든 학생의 국어와 영어 점수를 데이터 프레임으로 나타낸다.
1. 모든 학생의 각 과목 평균 점수를 새로운 열로 추가한다.
1. 방자의 영어 점수를 80점으로 수정하고 평균 점수도 다시 계산한다.
1. 춘향의 점수를 데이터프레임으로 나타낸다.
1. 향단의 점수를 시리즈로 나타낸다.

In [31]:
data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df = pd.DataFrame(data, index=index, columns=columns)
df['수학']

춘향    90
몽룡    60
향단    80
방자    70
Name: 수학, dtype: int64

In [33]:
df[['국어','영어']]

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  30  40

In [37]:
df["평균"] = ((df["국어"]+df["영어"]+df["수학"])/3).round(2)
df

    국어  영어  수학     평균
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  40  70  46.67

In [50]:
data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 80],
    "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df2 = pd.DataFrame(data, index=index, columns=columns)
df2["평균"] = ((df2["국어"]+df2["영어"]+df2["수학"])/3).round(2)
df2

    국어  영어  수학     평균
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  80  70  60.00

In [51]:
df2[0:1]

    국어  영어  수학     평균
춘향  80  90  90  86.67

In [58]:
df3=df2.T
df3['향단']

국어    70.0
영어    60.0
수학    80.0
평균    70.0
Name: 향단, dtype: float64

### 고급인덱싱
1. 모든 행과 열에 라벨을 가지는 5 x 5 이상의 크기를 가지는 데이터프레임을 만든다.
2. 10가지 이상의 방법으로 특정한 행과 열을 선택한다.

In [77]:
data = { "서울" : ['흐림', 30.3, 82, 69, 14.8],
       "청주" : ['구름많음', 33.2, 84, 59, 8.3],
       "대전" : ['구름많음', 32.8, 85, 65, 14],
       "전주" : ['구름많음', 32.2, 86, 78, 10.4],
       "울산" : ['구름조금', 32, 83, 64, 14.8],}
index = ["현재일기",'현재기온','불쾌지수','습도','풍속']
columns = ['서울', '청주', '대전', '전주', '울산']
weather = pd.DataFrame(data, index=index, columns=columns)
weather

        서울    청주    대전    전주    울산
현재일기    흐림  구름많음  구름많음  구름많음  구름조금
현재기온  30.3  33.2  32.8  32.2    32
불쾌지수    82    84    85    86    83
습도      69    59    65    78    64
풍속    14.8   8.3    14  10.4  14.8

In [78]:
weather.loc["현재일기"]

서울      흐림
청주    구름많음
대전    구름많음
전주    구름많음
울산    구름조금
Name: 현재일기, dtype: object

In [83]:
weather.loc['현재기온':'불쾌지수']

        서울    청주    대전    전주  울산
현재기온  30.3  33.2  32.8  32.2  32
불쾌지수    82    84    85    86  83

In [84]:
weather.loc['현재기온', '대전']

32.8

In [86]:
weather.loc['습도',:]

서울    69
청주    59
대전    65
전주    78
울산    64
Name: 습도, dtype: object

In [87]:
weather.loc[['습도','불쾌지수'],['서울','대전']]

      서울  대전
습도    69  65
불쾌지수  82  85

In [95]:
weather.loc[['현재기온','풍속'],['전주','울산']]

        전주    울산
현재기온  32.2    32
풍속    10.4  14.8

In [93]:
weather.iloc[0:1]

      서울    청주    대전    전주    울산
현재일기  흐림  구름많음  구름많음  구름많음  구름조금

In [96]:
weather.iloc[:2,2]

현재일기    구름많음
현재기온    32.8
Name: 대전, dtype: object

In [97]:
weather.iloc[0,-2:]

전주    구름많음
울산    구름조금
Name: 현재일기, dtype: object

In [98]:
weather.iloc[2:3, 1:3]

      청주  대전
불쾌지수  84  85

In [99]:
weather.iloc[-1]

서울    14.8
청주     8.3
대전      14
전주    10.4
울산    14.8
Name: 풍속, dtype: object

In [100]:
weather.iloc[-1]=weather.iloc[-1]*2
weather

        서울    청주    대전    전주    울산
현재일기    흐림  구름많음  구름많음  구름많음  구름조금
현재기온  30.3  33.2  32.8  32.2    32
불쾌지수    82    84    85    86    83
습도      69    59    65    78    64
풍속    29.6  16.6    28  20.8  29.6

#### 연습 문제 4.2.5

다음 명령으로 타이타닉호 승객 데이터를 데이터프레임으로 읽어온다. 이 명령을 실행하려면 seaborn 패키지가 설치되어 있어야 한다.

```
import seaborn as sns
titanic = sns.load_dataset("titanic")
```

타이타닉호 승객 데이터의 데이터 값을 각 열마다 구해본다.

In [105]:
import seaborn as sns
titanic = sns.load_dataset("titanic")
titanic.count()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

#### 연습 문제 4.2.6

타이타닉호 승객중 성별(sex) 인원수, 나이별(age) 인원수, 선실별(class) 인원수, 사망/생존(alive) 인원수를 구하라.

In [110]:
titanic.sex.value_counts()

male      577
female    314
Name: sex, dtype: int64

In [119]:
titanic.age.value_counts().sort_index()

0.42      1
0.67      1
0.75      2
0.83      2
0.92      1
1.00      7
2.00     10
3.00      6
4.00     10
5.00      4
6.00      3
7.00      3
8.00      4
9.00      8
10.00     2
11.00     4
12.00     1
13.00     2
14.00     6
14.50     1
15.00     5
16.00    17
17.00    13
18.00    26
19.00    25
20.00    15
20.50     1
21.00    24
22.00    27
23.00    15
         ..
44.00     9
45.00    12
45.50     2
46.00     3
47.00     9
48.00     9
49.00     6
50.00    10
51.00     7
52.00     6
53.00     1
54.00     8
55.00     2
55.50     1
56.00     4
57.00     2
58.00     5
59.00     2
60.00     4
61.00     3
62.00     4
63.00     2
64.00     2
65.00     3
66.00     1
70.00     2
70.50     1
71.00     2
74.00     1
80.00     1
Name: age, Length: 88, dtype: int64

In [121]:
titanic.pclass.value_counts().sort_index()

1    216
2    184
3    491
Name: pclass, dtype: int64

In [24]:
titanic.alive.value_counts()

no     549
yes    342
Name: alive, dtype: int64

#### 연습 문제 4.2.7
```
bins = [1, 15, 25, 35, 60, 99]
labels = ["미성년자", "청년", "중년", "장년", "노년"]
```

타이타닉호 승객을 사망자와 생존자 그룹으로 나누고 각 그룹에 대해 '미성년자', '청년', '중년', '장년', '노년' 승객의 비율을 구한다. 각 그룹 별로 비율의 전체 합은 1이 되어야 한다.

In [165]:
bins = [1, 15, 25, 35, 60, 99]
labels = ["미성년자", "청년", "중년", "장년", "노년"]
cats = pd.cut(ages, bins, labels=labels)

In [169]:
titanic['agegroup']=cats

In [167]:
titanic['agegroup'][titanic['survived']==0].value_counts(normalize =True)

청년      0.338863
장년      0.277251
중년      0.267773
미성년자    0.075829
노년      0.040284
Name: agegroup, dtype: float64

In [168]:
titanic['agegroup'][titanic['survived']==1].value_counts(normalize =True)

중년      0.298561
장년      0.280576
청년      0.269784
미성년자    0.133094
노년      0.017986
Name: agegroup, dtype: float64